; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Ivica Hrvoj Ivanić <punkrollonja@linuxmail.org>
; Homepage:	http://www.ups-umag.org
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&U redu"
CANCEL_BUT = "&Odustani"
MAIN_DEST_DIR_LABEL = "Odredišni &imenik:"
MAIN_FILE_LABEL = "&Arhiva/Instalator za izvlačenje:"
MENU_FILE_LABEL = "&Datoteka"
MENU_FILE_QUIT_LABEL = "&Zatvori"
MENU_EDIT_LABEL = "U&redi"
MENU_EDIT_PREFS_LABEL = "&Preference"
MENU_HELP_LABEL = "Po&moć"
MENU_HELP_WEB_LABEL = "%s &Web stranica"
PREFS_TITLE_LABEL = "Preference"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor Opcije"
PREFS_HISTORY_LABEL = "Prati po&vijest arhiva"
PREFS_FORMAT_OPTS_LABEL = "Odrednice formata"
PREFS_LANG_LABEL = "&Jezik"
PREFS_DEBUG_LABEL = "Imenik de&bug datoteke:"
PREFS_WARN_EXECUTE_LABEL = "&Upozori prije izvršenja datoteke"
PREFS_REMOVE_DUPE_LABEL = "U&kloni dvostruke datoteke"
PREFS_REMOVE_TEMP_LABEL = "Ukloni privremene da&toteke"
PREFS_APPEND_EXT_LABEL = "Dodaj nedostajuće &ekstenzije"
METHOD_ADMIN_RADIO = "%s Administrativni Installer"
METHOD_EXTRACTION_RADIO = "%s izvlačenja"
METHOD_HEADER = "%s Izvlačenje"
METHOD_MSI_NOTE_LABEL = "Pazi:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml zahtijeva"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Metoda izvlačenja"
METHOD_SWITCH_RADIO = "%s prebacivanje"
METHOD_NOTIS_RADIO = "Nije InstallShield installer"
METHOD_TEXT_LABEL = "%s podržava sledeće metode za izvlačenje %s paketa.  Na žalost, nijedna od metoda nije 100% pouzdana.  Ako predložena metoda ne radi, ponovi postupak %s odabravši drugu metodu."
METHOD_UNPACKER_RADIO = "%s Raspakiravač"

; GUI control functions
DOES_NOT_EXIST = "ne postoji.%n"
EXTRACT_TO = "Izvuci u"
INVALID_DIR_SELECTED =  "%s nije valjan imenik."
INVALID_FILE_SELECTED = "%sOdaberi valjanu datoteku."
OPEN_FILE = "Otvori datoteku"
SELECT_FILE = "Odaberi datoteku"
WRITE_TO = "Piši u"

; Common terms
TERM_ARCHIVE = "Arhiva"
TERM_COMPRESSED = "Komprimirana datoteka"
TERM_DISK = "Disk"
TERM_EBOOK = "e-knjiga"
TERM_ECARD = "e-kartica"
TERM_ENCODED = "Enkodirana datoteka"
TERM_EXECUTABLE = "Izvršna datoteka"
TERM_FAILED = "propalo"
TERM_HELP = "Datoteka pomoći"
TERM_HOTFIX = "Nadogradna zakrpa"
TERM_IMAGE = "Preslik"
TERM_INSTALLER = "Instalator"
TERM_PACKAGE = "Paket"
TERM_PATCH = "Zakrpa"
TERM_SFX = "Samo-raspakirajuće"
TERM_STAGE = "Faza"
TERM_SUCCEEDED = "uspjelo"
TERM_TESTING = "Testiranje"
TERM_UNKNOWN = "Nepoznato"
TERM_UNPACKED = "Nezapakirano"
TERM_UPDATER = "Nadogradjivač"

; Status messages
SCANNING_FILE = "Snimanje datoteke i odredjivanje vrste."
SCANNING_EXE = "Skeniranje datoteke s %s skenom."
EXTRACTING = "Izvlačenje datoteka iz:"
INIT_WAIT = "Pričekaj dok se instalator pokrene."

; Custom prompts
CONVERT_CDROM = "%s CD-ROM preslici ne mogu se izvlačiti izravno.  Umjesto toga, ovaj preslik %nbit će pretvoren u ISO CD-ROM preslik, koji će zatim biti ekstrahiran.%n%nDa nastavimo?%nPazi: Ovo će potrajati nekoliko minuta."
CONVERT_CDROM_STAGE1_FAILED = "Greška: CD-ROM preslik ne može se pretvoriti.%nAko je ovo BIN/CUE preslik, provjeri ispravnost arhive."
CONVERT_CDROM_STAGE2_FAILED = "Greška: ISO preslik stvoren je od %s preslika, ali ne može biti pretvoren.%n%nDa zadržimo ISO preslik za dalju upotrebu??"
CONVERT_BIN_MISSING = "Greška: Ne mogu naći:%n%s\%s.%s%n%nOba %s.bin i %s.cue su potrebni."
INIT_COMPLETE = "Inicijalizacija %s.  Zatvori instalator, zatim pritisni U redu za nastavak."
WISE_MSI_PROMPT = "Pazi:  Ova metoda radi samo s odredjenim Wise-ovima za Windows Installer pakete.%nAko Wise Installation Wizard krene i prosto čeka na unos, onda ta datoteka nije podržana%npodržano.  Zatvori instalator, a %s će abortirati izvlačenje.%n%nDa nastavimo?"
UNPACK_PROMPT = "Ova datoteka je zapakirana %s sažimanjem, ali se ne može ekstrahirati.%nOvo može biti stoga što je format nepodržan, ili što%njednostavno unutra nema datoteka za izvlačenje.%n%nDa raspakiramo tu datoteku umjesto toga?%n%nPazi: raspakirana datoteka bit će imenovana kao:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Greška: %s%nne može se raspakirat."
WARN_EXECUTE = "Pozor:  Da bi se izvukle datoteke ovoga tipa, arhiva mora biti izravno pokrenuta.%nAko nastavimo, pokrenut će se sledeća naredba:%n%n%s%n%nAko vjeruješ da je datoteka slučajno maliciozna, bolje ne nastavljaj.%nDa nastavimo s izvlačenjem?"

; Help text
HELP_SUMMARY = "Izvuci datoteke iz bilo koje arhive ili instalacijskoga paketa."
HELP_SYNTAX = "%nKorištenje:  %s [/help] [filename [destination]]"
HELP_ARGUMENTS = "%n%nPodržani argumenti:"
HELP_HELP = "%n     /Pomoć%t%tPrikaži ovu pomoćnu obavijest"
HELP_FILENAME = "%n     Naziv%ime datoteke za izvlačenje"
HELP_DESTINATION = "%n     Odredište%tImenik za izvlačenje"
HELP_SUB = "%n%nProlaz /sub umjesto instrukcija za odredišni imenik%n%s za izvlačenje u podimenik imenovan prema arhivi."
HELP_EXAMPLE1 = "%n%nPrimjer:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nIzvršavanjem %s bez ikakvih "argumenata"%npita se koristnika za odredišni naziv datoteke i imenik."

; Error messages
CANNOT_LOG = "%s Izlavačenja ne mogu biti logirana."
CANNOT_FIND = "%s ne može se pronaći."
CANNOT_EXTRACT = "%s ne može se izvući.%nPovrat formata bio je: %s%n%nKlikni U redu ako želiš raščlaniti datoteku preko same nje (samoizvršavanjem), ili klikni Odustani za izlazak."
UNKNOWN_EXT = "%s%nima nepoznatu ekstenziju i ne može se ekstrahirati."
INVALID_DIR = "%s%nnije se moglo stvoriti.  Odaberi valjano odredište."
EXTRACT_FAILED = "%s nije se moglo ekstrahirati.%nIzgleda da je to(n) %s, koji je podržan, ali izvlačenje nije uspjelo.%nPogledaj log datoteku, %s, za više obavijesti.%n%nKlini U redu za pregled log-datoteke, ili odustani za izlazak."

[Installer]
; Components page
COMP_DOCS = "Documentacija i licenca"
COMP_LANG = "Jezične datoteke"
COMP_ACE = "Podrška za ACE datoteke"
COMP_KGB = "Podrška za KGB datoteke"
COMP_PEA = "Podrška za PEA datoteke"
COMP_SIT = "Podrška za StuffIt datoteke"

; Preferences page
PREFS_CAPTION = "Postavi opcije programa"
PREFS_DESCRIPTION = "Koje opcije Univerzalnoga Ekstraktora želiš postaviti?"
PREFS_LABEL1 = "Mogu se namjestiti sledeće postavke za podešavanje ponašanja Univerzalnoga Ekstraktora."
PREFS_LABEL2 = "Ove opcije mogu se promijeniti i nakon instalacije mijenjajući UniExtract.ini."
LANGUAGE_LABEL = "Zadani jezik"
DEBUG_LABEL = "Mjesto debug datoteke"
APPEND_EXT_LABEL = "&Dodaj nedostajuće produžetke"
HISTORY_LABEL = "&Održavaj povijest arhiva"
REMOVE_DUPE_LABEL = "ukloni &dvostkuke datoteke"
REMOVE_TEMP_LABEL = "Ukloni pri&vremene datoteke"
WARN_EXECUTE_LABEL = "&Upozori prije izvršavanja datoteka"

; Tasks page
ASSOCIATE = "Omogući integraciju u padajući izbornik &Explorera"
ASSOCIATE_FILES = "Dodaj 'UniExtract: &izvuci' u padajući izbornik"
ASSOCIATE_HERE = "Dodaj 'UniExtract: izvuci &tu' u padaju'i izbornik"
ASSOCIATE_SUBDIR = "Dodaj 'UniExtract: izvuci u &podimenik' u padajući izbornik"
ASSOCIATE_FORCE = "Prisili &asocijaciju sa svim podržanim formatima"
MODIFY_PATH = "Dodaj Universal Extractor u sistemsku &putanju"
DESKTOP_ICON = "Stvori &ikonu radne plohe"
QUICK_LAUNCH_ICON = "Stvori ikonu za &hitro pokretanje"
SENDTO_ICON = "Create a Send&To icon"

; Context Menu integration
EXTRACT_FILES = "UniExtract: &izvuci"
EXTRACT_HERE = "UniExtract: izvuci &tu"
EXTRACT_SUB = "UniExtract: izvuci u &podimenik"
